Reports/ТЗ_на_согласовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ТЗ_на_согласовании</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/КанбанКолонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКолонки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеПриПопадании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйПереход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещенИнтерактивныйУход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитКарточек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛимитЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанПереходКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанПереходКарточки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВКолонке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаДорожка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДКудаКолонка</Name>
					<Comment>"1"  выполнена. "100"  корзина "200" приостановлена.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДКарточка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанКарточки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Доска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Comment>ПустаяСтрока по умолчанию</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КанбанДополнительныеДанныеПерехода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КанбанДополнительныеДанныеПерехода</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дополнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДПерехода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДополнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТаймингЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТаймингЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СбросСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение,</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УвеличениеСчетчика</Name>
					<Comment>0 не изменяет,, 1 доработка, 2 корректировка, 4 изменение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ТЗ_на_согласовании/Ext/ManagerModule.bsl
Функция ПолучитьФайлНаСервере(ИмяФайла) Экспорт

	ТД = ТекущаяДата();
	ИмяФайла = "ТЗ_на_согласовании_" + Формат(Год(ТД), "ЧГ=0") + "_" + Месяц(ТД) + "_" + День(ТД) + ".pdf";

	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("pdf");
	
	СоздатьФайлОтчета(ИмяПромежуточногоФайла);
	
	Двоичное 	= Новый ДвоичныеДанные(ИмяПромежуточногоФайла);  // получаем двоичные данные из файла
	Адрес 		= ПоместитьВоВременноеХранилище(Двоичное); // кидаем двоичные данные во врем. хранилище
	
	Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	Исключение
	КонецПопытки;
	
	Возврат Адрес;

КонецФункции // ПолучитьФайлНаСервере()

Функция СоздатьФайлОтчета(ПутьКФайлу = "", ПолеВывода = Неопределено, ТипФайла = Неопределено) Экспорт

	Если ПолеВывода = Неопределено Тогда
	
		ПолеВывода = Новый ТабличныйДокумент;	
	
	КонецЕсли;
	
	СформироватьОтчетНаСервере(ПолеВывода);
	
	Если НЕ ПустаяСтрока(ПутьКФайлу) Тогда
	
		ПолеВывода.Записать(ПутьКФайлу, ?(ТипФайла = Неопределено, ТипФайлаТабличногоДокумента.PDF, ТипФайла));		
	
	КонецЕсли;
	
КонецФункции // СоздатьФайлОтчета() 

Процедура СформироватьОтчетНаСервере(ПолеВывода)
	
	стТаблицы = ПолучитьТаблицуДанных();
	
	ВывестиДанные(стТаблицы, ПолеВывода);
	
КонецПроцедуры // СформироватьОтчетНаСервере()

Функция ПолучитьТаблицуДанных()
	
	УстановитьПривилегированныйРежим(Истина);
	
	тзДанныеЗапрос 	= ЗаполнитьКомплектыИзделий();
	
	тзДанные = РассчитатьПоля(тзДанныеЗапрос);
	
	Возврат Новый Структура("тзДанные", тзДанные);
	
КонецФункции // ПолучитьТаблицуДанных()     

Функция РассчитатьПоля(тзДанныеЗапрос) 
	
	ТипСтрока 	= Новый ОписаниеТипов("Строка");
	ТипДата 	= Новый ОписаниеТипов("Дата");
	ТипБулево 	= Новый ОписаниеТипов("Булево");
	ТипЧисло 	= Новый ОписаниеТипов("Число");
	
	тзДанные = Новый ТаблицаЗначений;
	тзДанные.Колонки.Добавить("НаименованиеКолонки", 			ТипСтрока);
	тзДанные.Колонки.Добавить("ПользовательНаименование",		ТипСтрока);
	тзДанные.Колонки.Добавить("Пользователь",					Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	тзДанные.Колонки.Добавить("Дата", 							ТипДата);
	тзДанные.Колонки.Добавить("Статус",							Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЗадач"));
	тзДанные.Колонки.Добавить("Ресурс", 						);
	тзДанные.Колонки.Добавить("РесурсНаименование",				ТипСтрока);
	тзДанные.Колонки.Добавить("Комментарий", 					ТипСтрока);
	тзДанные.Колонки.Добавить("КоличествоДней", 				ТипЧисло);
	
	
	ТД 						= КонецДня(ТекущаяДата());
	КоличествоСекундВСутках	= 24 * 3600;
	
	текущаяКомпозиция 	= Неопределено;
	Для каждого х Из тзДанныеЗапрос Цикл 
		
		НС = тзДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НС, х);
		
		НС.КоличествоДней = Окр((ТД - х.Дата) / КоличествоСекундВСутках, 0);
		
	КонецЦикла;
	
	Возврат тзДанные;
	
КонецФункции

Функция ЗаполнитьКомплектыИзделий()
	
	Статусы = Новый Массив(2);
	Статусы[0] = Перечисления.СтатусыЗадач.ТЗВнутреннееОжидание;
	Статусы[1] = Перечисления.СтатусыЗадач.ТЗВнешнееОжидание;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КанбанКолонки.УИД КАК УИД,
		|	КанбанКолонки.Статус КАК Статус
		|ПОМЕСТИТЬ втКолонки
		|ИЗ
		|	РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|ГДЕ
		|	КанбанКолонки.Доска = &Доска
		|	И КанбанКолонки.Статус В(&Статус)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КанбанПереходКарточкиСрезПоследних.Пользователь КАК Пользователь,
		|	КанбанПереходКарточкиСрезПоследних.Период КАК Дата,
		|	втКолонки.Статус КАК Статус,
		|	КанбанКарточки.Ресурс КАК Ресурс,
		|	ЕСТЬNULL(КанбанДополнительныеДанныеПерехода.Комментарий, """") КАК Комментарий,
		|	КанбанКолонки.Наименование КАК НаименованиеКолонки,
		|	КанбанПереходКарточкиСрезПоследних.Пользователь.Наименование КАК ПользовательНаименование,
		|	КанбанКарточки.Ресурс.Наименование КАК РесурсНаименование
		|ПОМЕСТИТЬ втКомплекты
		|ИЗ
		|	РегистрСведений.КанбанПереходКарточки.СрезПоследних КАК КанбанПереходКарточкиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКарточки КАК КанбанКарточки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКарточка = КанбанКарточки.УИД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКолонки КАК втКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = втКолонки.УИД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КанбанДополнительныеДанныеПерехода КАК КанбанДополнительныеДанныеПерехода
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДПерехода = КанбанДополнительныеДанныеПерехода.УИДПерехода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КанбанКолонки КАК КанбанКолонки
		|		ПО КанбанПереходКарточкиСрезПоследних.УИДКудаКолонка = КанбанКолонки.УИД
		|ГДЕ
		|	КанбанКарточки.Доска = &Доска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаймингЗадачСрезПоследних.Автор,
		|	ТаймингЗадачСрезПоследних.Период,
		|	""Согласование ПКД"",
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ,
		|	"""",
		|	""Согласование ПКД"",
		|	ТаймингЗадачСрезПоследних.Автор.Наименование,
		|	ТаймингЗадачСрезПоследних.Задача.ОбъектТЗ.Наименование
		|ИЗ
		|	РегистрСведений.ТаймингЗадач.СрезПоследних КАК ТаймингЗадачСрезПоследних
		|ГДЕ
		|	ТаймингЗадачСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗадач.Согласование)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКомплекты.Пользователь КАК Пользователь,
		|	втКомплекты.Дата КАК Дата,
		|	втКомплекты.Статус КАК Статус,
		|	втКомплекты.Ресурс КАК Ресурс,
		|	втКомплекты.Комментарий КАК Комментарий,
		|	втКомплекты.НаименованиеКолонки КАК НаименованиеКолонки,
		|	втКомплекты.ПользовательНаименование КАК ПользовательНаименование,
		|	втКомплекты.РесурсНаименование КАК РесурсНаименование
		|ИЗ
		|	втКомплекты КАК втКомплекты
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКолонки,
		|	Дата";
	
	Запрос.УстановитьПараметр("Доска", омКанбанДоскиНаСервереПовтор.ПолучитьУИДДоски("УИДДоскиДляТЗ"));
	Запрос.УстановитьПараметр("Статус", Статусы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции // ЗаполнитьКомплектыИзделий()

Процедура ВывестиДанные(стТаблицы, ПолеВывода)
	
	КоличествоСекундВДне 	= 3600 * 24;
	ПустаяДата				= Дата(1, 1, 1);
	СекундВНеделе			= КоличествоСекундВДне * 7;
	ТД						= НачалоДня(ТекущаяДата());

	Макет = Отчеты.ТЗ_на_согласовании.ПолучитьМакет("Макет");
	
	ПолеВывода.Очистить();
	
	ПолеВывода.РазмерСтраницы 		= "A4";
	ПолеВывода.АвтоМасштаб 			= Ложь;
	ПолеВывода.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	
	обШапка 	= Макет.ПолучитьОбласть("Шапка");
	обСтрока 	= Макет.ПолучитьОбласть("Строка"); 
	обСтатус 	= Макет.ПолучитьОбласть("Статус");
	
	обШапка.Параметры.ДатаПечати = "Дата печати " + Формат(ТекущаяДата(), "ДЛФ=DDT");
	ПолеВывода.Вывести(обШапка); 
	
	ТекущийСтатус = Неопределено;
	
	Для каждого текСтрока Из стТаблицы.тзДанные Цикл
		
		Если НЕ ТекущийСтатус = текСтрока.НаименованиеКолонки Тогда
		
			ТекущийСтатус = текСтрока.НаименованиеКолонки;
			обСтатус.Параметры.НаименованиеКолонки = ТекущийСтатус;
			ПолеВывода.Вывести(обСтатус); 
		
		КонецЕсли;
		
		обСтрока.Параметры.Заполнить(текСтрока);
		ПолеВывода.Вывести(обСтрока); 
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиДанные()
